"""
Користејќи list comprehension дадена матрица составена од броеви да се промени секој елемент така што ќе се помножи со 2.
Секој елемент на матрицата се чита од тастатура така што прво се читаат N и M (број на редици и колони),
а потоа во секој ред се читаат елементите одделени со празно место

Пример влез:
4
4
1 2 3 4
1 2 3 4
1 2 3 4
1 2 3 4

Излез: [[2, 4, 6, 8], [2, 4, 6, 8], [2, 4, 6, 8], [2, 4, 6, 8]]
"""

n = int(input())
m = int(input())
matrix = []
for i in range(n):
    row = [int(element) for element in input().split(" ")]
    matrix.append(row)
result = [i * 2 for row in matrix for i in row]
print(result)
